app/controllers/calendar_controller.rb

  	def show_day
		#@user = current_user
		@user = User.find(1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  	def show_week
		#@user = current_user
		@user = User.find(1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  	def show_month
		#@user = current_user
		@user = User.find(1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]