app/controllers/homepage_controller.rb

  def post_index
    return unless validate_input

    email = Email.find_by(email: params[:homepage][:email].downcase)
    user = User.find_by(primary_email_id: email.id) if email
---
SELECT  "emails".* FROM "emails" WHERE "emails"."email" = $1 LIMIT $2  [["email", "t.t@t.t"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "emails" WHERE "emails"."email" = $1  [["email", "q.q@q.q"]]
SELECT  "users".* FROM "users" WHERE "users"."primary_email_id" = $1 LIMIT $2  [["primary_email_id", 35], ["LIMIT", 1]]