app/controllers/meeting_controller.rb

	def show
		@back_path = request.referer
		@user = current_user
		@meeting = Meeting.find(params['id'])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]