app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
	def show
		require_login
		@user = User.find(params[:id])

DELETE FROM "incomplete_users" WHERE "incomplete_users"."id" = $1  [["id", 13]]
INSERT INTO "emails" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "t.t@t.t"], ["created_at", "2017-12-05 18:09:54.657280"], ["updated_at", "2017-12-05 18:09:54.657280"]]
INSERT INTO "users" ("name", "surname", "nickname", "password_digest", "preference_list", "created_at", "updated_at", "primary_email_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
	def create
		email_hash = params.slice(:user)['user']['email']
		params[:user].delete('email')

		incomplete_user = IncompleteUser.find(session[:tmp_checked])
		incomplete_user_email = incomplete_user.email
		incomplete_user_psw = incomplete_user.password

		@user = User.new(user_params)
		unless email_hash == incomplete_user_email && incomplete_user.authenticate(@user.password)
			flash.now[:danger] = 'Wrong mail or password'
			@unregistered_user = incomplete_user
			render 'new'
			return
		end
		if @user.valid?
			session[:tmp_checked] = nil # delete temp variable
			IncompleteUser.delete(incomplete_user.id)
			email = Email.create(email: email_hash)
			@user.emails.push(email)
			@user.primary_email_id = email.id
			email.user_id = if User.last then

SELECT  "incomplete_users".* FROM "incomplete_users" WHERE "incomplete_users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
	def new
		@unregistered_user = IncompleteUser.find(session[:tmp_checked])